panel/classes/fedex/wsdl/Shipping_SampleTransactions/FedExTag - Ground.txt

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://fedex.com/ws/ship/v13"><SOAP-ENV:Body><ns1:ProcessTagRequest><ns1:WebAuthenticationDetail><ns1:UserCredential><ns1:Key>"Input Your Information"</ns1:Key><ns1:Password>"Input Your Information"</ns1:Password></ns1:UserCredential></ns1:WebAuthenticationDetail><ns1:ClientDetail><ns1:AccountNumber>"Input Your Information"</ns1:AccountNumber><ns1:MeterNumber>"Input Your Information"</ns1:MeterNumber></ns1:ClientDetail><ns1:TransactionDetail><ns1:CustomerTransactionId>*** Ground Call Tag Request v13 ***</ns1:CustomerTransactionId></ns1:TransactionDetail><ns1:Version><ns1:ServiceId>ship</ns1:ServiceId><ns1:Major>13</ns1:Major><ns1:Intermediate>0</ns1:Intermediate><ns1:Minor>0</ns1:Minor></ns1:Version><ns1:RequestedShipment><ns1:ShipTimestamp>2013-07-17T15:30:00+05:30</ns1:ShipTimestamp><ns1:DropoffType>REGULAR_PICKUP</ns1:DropoffType><ns1:ServiceType>FEDEX_GROUND</ns1:ServiceType><ns1:PackagingType>YOUR_PACKAGING</ns1:PackagingType><ns1:Shipper><ns1:Contact><ns1:PersonName>Sender Name</ns1:PersonName><ns1:CompanyName>Sender Company Name</ns1:CompanyName><ns1:PhoneNumber>1234567890</ns1:PhoneNumber></ns1:Contact><ns1:Address><ns1:StreetLines>Address Line 1</ns1:StreetLines><ns1:City>Collierville</ns1:City><ns1:StateOrProvinceCode>TN</ns1:StateOrProvinceCode><ns1:PostalCode>38017</ns1:PostalCode><ns1:CountryCode>US</ns1:CountryCode><ns1:Residential>true</ns1:Residential></ns1:Address></ns1:Shipper><ns1:Recipient><ns1:Contact><ns1:PersonName>Recipient Name</ns1:PersonName><ns1:CompanyName>Recipient Company Name</ns1:CompanyName><ns1:PhoneNumber>1234567890</ns1:PhoneNumber></ns1:Contact><ns1:Address><ns1:StreetLines>Address Line 1</ns1:StreetLines><ns1:City>Herndon</ns1:City><ns1:StateOrProvinceCode>VA</ns1:StateOrProvinceCode><ns1:PostalCode>20171</ns1:PostalCode><ns1:CountryCode>US</ns1:CountryCode><ns1:Residential>true</ns1:Residential></ns1:Address></ns1:Recipient><ns1:ShippingChargesPayment><ns1:PaymentType>SENDER</ns1:PaymentType><ns1:Payor><ns1:ResponsibleParty><ns1:AccountNumber>"Input Your Information"</ns1:AccountNumber><ns1:Contact/><ns1:Address><ns1:CountryCode>US</ns1:CountryCode></ns1:Address></ns1:ResponsibleParty></ns1:Payor></ns1:ShippingChargesPayment><ns1:SpecialServicesRequested><ns1:SpecialServiceTypes>RETURN_SHIPMENT</ns1:SpecialServiceTypes><ns1:ReturnShipmentDetail><ns1:ReturnType>FEDEX_TAG</ns1:ReturnType><ns1:Rma><ns1:Reason>reason</ns1:Reason></ns1:Rma></ns1:ReturnShipmentDetail></ns1:SpecialServicesRequested><ns1:PickupDetail><ns1:ReadyDateTime>2013-07-17T15:30:00+05:30</ns1:ReadyDateTime><ns1:LatestPickupDateTime>2013-07-17T15:30:00+05:30</ns1:LatestPickupDateTime><ns1:CourierInstructions>Left on porch</ns1:CourierInstructions></ns1:PickupDetail><ns1:LabelSpecification><ns1:LabelFormatType>COMMON2D</ns1:LabelFormatType><ns1:ImageType>PNG</ns1:ImageType></ns1:LabelSpecification><ns1:RateRequestTypes>LIST</ns1:RateRequestTypes><ns1:PackageCount>1</ns1:PackageCount><ns1:RequestedPackageLineItems><ns1:SequenceNumber>1</ns1:SequenceNumber><ns1:InsuredValue><ns1:Currency>USD</ns1:Currency><ns1:Amount>1500</ns1:Amount></ns1:InsuredValue><ns1:Weight><ns1:Units>LB</ns1:Units><ns1:Value>2</ns1:Value></ns1:Weight><ns1:Dimensions><ns1:Length>25</ns1:Length><ns1:Width>25</ns1:Width><ns1:Height>25</ns1:Height><ns1:Units>IN</ns1:Units></ns1:Dimensions><ns1:ItemDescription>Laptop</ns1:ItemDescription><ns1:CustomerReferences><ns1:CustomerReferenceType>INVOICE_NUMBER</ns1:CustomerReferenceType><ns1:Value>INV4567892</ns1:Value></ns1:CustomerReferences></ns1:RequestedPackageLineItems></ns1:RequestedShipment></ns1:ProcessTagRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>
